###################################################################

# Created by write_sdc on Mon Jun 2 22:08:30 2025

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current uA
set_driving_cell -lib_cell IBUFFX4_LVT -library saed32lvt_ff1p16v25c -pin Y [get_ports {TxDataHS[15]}]
set_driving_cell -lib_cell IBUFFX4_LVT -library saed32lvt_ff1p16v25c -pin Y [get_ports {TxDataHS[14]}]
set_driving_cell -lib_cell IBUFFX4_LVT -library saed32lvt_ff1p16v25c -pin Y [get_ports {TxDataHS[13]}]
set_driving_cell -lib_cell IBUFFX4_LVT -library saed32lvt_ff1p16v25c -pin Y [get_ports {TxDataHS[12]}]
set_driving_cell -lib_cell IBUFFX4_LVT -library saed32lvt_ff1p16v25c -pin Y [get_ports {TxDataHS[11]}]
set_driving_cell -lib_cell IBUFFX4_LVT -library saed32lvt_ff1p16v25c -pin Y [get_ports {TxDataHS[10]}]
set_driving_cell -lib_cell IBUFFX4_LVT -library saed32lvt_ff1p16v25c -pin Y [get_ports {TxDataHS[9]}]
set_driving_cell -lib_cell IBUFFX4_LVT -library saed32lvt_ff1p16v25c -pin Y [get_ports {TxDataHS[8]}]
set_driving_cell -lib_cell IBUFFX4_LVT -library saed32lvt_ff1p16v25c -pin Y [get_ports {TxDataHS[7]}]
set_driving_cell -lib_cell IBUFFX4_LVT -library saed32lvt_ff1p16v25c -pin Y [get_ports {TxDataHS[6]}]
set_driving_cell -lib_cell IBUFFX4_LVT -library saed32lvt_ff1p16v25c -pin Y [get_ports {TxDataHS[5]}]
set_driving_cell -lib_cell IBUFFX4_LVT -library saed32lvt_ff1p16v25c -pin Y [get_ports {TxDataHS[4]}]
set_driving_cell -lib_cell IBUFFX4_LVT -library saed32lvt_ff1p16v25c -pin Y [get_ports {TxDataHS[3]}]
set_driving_cell -lib_cell IBUFFX4_LVT -library saed32lvt_ff1p16v25c -pin Y [get_ports {TxDataHS[2]}]
set_driving_cell -lib_cell IBUFFX4_LVT -library saed32lvt_ff1p16v25c -pin Y [get_ports {TxDataHS[1]}]
set_driving_cell -lib_cell IBUFFX4_LVT -library saed32lvt_ff1p16v25c -pin Y [get_ports {TxDataHS[0]}]
set_driving_cell -lib_cell IBUFFX4_LVT -library saed32lvt_ff1p16v25c -pin Y [get_ports TxSendSyncHS]
set_driving_cell -lib_cell IBUFFX4_LVT -library saed32lvt_ff1p16v25c -pin Y [get_ports TxReqHS]
set_driving_cell -lib_cell IBUFFX4_LVT -library saed32lvt_ff1p16v25c -pin Y [get_ports TxReqEsc]
set_driving_cell -lib_cell IBUFFX4_LVT -library saed32lvt_ff1p16v25c -pin Y [get_ports TxLpdtEsc]
set_driving_cell -lib_cell IBUFFX4_LVT -library saed32lvt_ff1p16v25c -pin Y [get_ports TxUlpsEsc]
set_driving_cell -lib_cell IBUFFX4_LVT -library saed32lvt_ff1p16v25c -pin Y [get_ports TxUlpsExit]
set_driving_cell -lib_cell IBUFFX4_LVT -library saed32lvt_ff1p16v25c -pin Y [get_ports {TxTriggerEsc[3]}]
set_driving_cell -lib_cell IBUFFX4_LVT -library saed32lvt_ff1p16v25c -pin Y [get_ports {TxTriggerEsc[2]}]
set_driving_cell -lib_cell IBUFFX4_LVT -library saed32lvt_ff1p16v25c -pin Y [get_ports {TxTriggerEsc[1]}]
set_driving_cell -lib_cell IBUFFX4_LVT -library saed32lvt_ff1p16v25c -pin Y [get_ports {TxTriggerEsc[0]}]
set_driving_cell -lib_cell IBUFFX4_LVT -library saed32lvt_ff1p16v25c -pin Y [get_ports {TxDataEsc[7]}]
set_driving_cell -lib_cell IBUFFX4_LVT -library saed32lvt_ff1p16v25c -pin Y [get_ports {TxDataEsc[6]}]
set_driving_cell -lib_cell IBUFFX4_LVT -library saed32lvt_ff1p16v25c -pin Y [get_ports {TxDataEsc[5]}]
set_driving_cell -lib_cell IBUFFX4_LVT -library saed32lvt_ff1p16v25c -pin Y [get_ports {TxDataEsc[4]}]
set_driving_cell -lib_cell IBUFFX4_LVT -library saed32lvt_ff1p16v25c -pin Y [get_ports {TxDataEsc[3]}]
set_driving_cell -lib_cell IBUFFX4_LVT -library saed32lvt_ff1p16v25c -pin Y [get_ports {TxDataEsc[2]}]
set_driving_cell -lib_cell IBUFFX4_LVT -library saed32lvt_ff1p16v25c -pin Y [get_ports {TxDataEsc[1]}]
set_driving_cell -lib_cell IBUFFX4_LVT -library saed32lvt_ff1p16v25c -pin Y [get_ports {TxDataEsc[0]}]
set_driving_cell -lib_cell IBUFFX4_LVT -library saed32lvt_ff1p16v25c -pin Y [get_ports TxValidEsc]
set_driving_cell -lib_cell IBUFFX4_LVT -library saed32lvt_ff1p16v25c -pin Y [get_ports {LpRx[2]}]
set_driving_cell -lib_cell IBUFFX4_LVT -library saed32lvt_ff1p16v25c -pin Y [get_ports {LpRx[1]}]
set_driving_cell -lib_cell IBUFFX4_LVT -library saed32lvt_ff1p16v25c -pin Y [get_ports {LpRx[0]}]
set_driving_cell -lib_cell IBUFFX4_LVT -library saed32lvt_ff1p16v25c -pin Y [get_ports TurnRequest]
set_driving_cell -lib_cell IBUFFX4_LVT -library saed32lvt_ff1p16v25c -pin Y [get_ports TurnDisable]
set_driving_cell -lib_cell IBUFFX4_LVT -library saed32lvt_ff1p16v25c -pin Y [get_ports ForceRxmode]
set_driving_cell -lib_cell IBUFFX4_LVT -library saed32lvt_ff1p16v25c -pin Y [get_ports ForceTxStopmode]
set_driving_cell -lib_cell IBUFFX4_LVT -library saed32lvt_ff1p16v25c -pin Y [get_ports Enable]
set_driving_cell -lib_cell IBUFFX4_LVT -library saed32lvt_ff1p16v25c -pin Y [get_ports LP_CD_A]
set_driving_cell -lib_cell IBUFFX4_LVT -library saed32lvt_ff1p16v25c -pin Y [get_ports LP_CD_B]
set_driving_cell -lib_cell IBUFFX4_LVT -library saed32lvt_ff1p16v25c -pin Y [get_ports LP_CD_C]
set_load -pin_load 15 [get_ports TxReadyHS]
set_load -pin_load 15 [get_ports {A[1]}]
set_load -pin_load 15 [get_ports {A[0]}]
set_load -pin_load 15 [get_ports {B[1]}]
set_load -pin_load 15 [get_ports {B[0]}]
set_load -pin_load 15 [get_ports {C[1]}]
set_load -pin_load 15 [get_ports {C[0]}]
set_load -pin_load 15 [get_ports HsTxEn]
set_load -pin_load 15 [get_ports TxReadyEsc]
set_load -pin_load 15 [get_ports {LpTx[2]}]
set_load -pin_load 15 [get_ports {LpTx[1]}]
set_load -pin_load 15 [get_ports {LpTx[0]}]
set_load -pin_load 15 [get_ports LpTxEn]
set_load -pin_load 15 [get_ports Direction]
set_load -pin_load 15 [get_ports Stopstate]
set_load -pin_load 15 [get_ports UlpsActiveNot]
set_load -pin_load 15 [get_ports ErrContentionLP0]
set_load -pin_load 15 [get_ports ErrContentionLP1]
set_load -pin_load 15 [get_ports {RxEscData[7]}]
set_load -pin_load 15 [get_ports {RxEscData[6]}]
set_load -pin_load 15 [get_ports {RxEscData[5]}]
set_load -pin_load 15 [get_ports {RxEscData[4]}]
set_load -pin_load 15 [get_ports {RxEscData[3]}]
set_load -pin_load 15 [get_ports {RxEscData[2]}]
set_load -pin_load 15 [get_ports {RxEscData[1]}]
set_load -pin_load 15 [get_ports {RxEscData[0]}]
set_load -pin_load 15 [get_ports LpRxEn]
set_load -pin_load 15 [get_ports RxValidEsc]
set_load -pin_load 15 [get_ports {RxTriggerEsc[3]}]
set_load -pin_load 15 [get_ports {RxTriggerEsc[2]}]
set_load -pin_load 15 [get_ports {RxTriggerEsc[1]}]
set_load -pin_load 15 [get_ports {RxTriggerEsc[0]}]
set_load -pin_load 15 [get_ports RxUlpsEsc]
set_load -pin_load 15 [get_ports RxLpdtEsc]
set_load -pin_load 15 [get_ports ErrEsc]
set_load -pin_load 15 [get_ports ErrSyncEsc]
set_load -pin_load 15 [get_ports ErrControl]
create_clock [get_ports TxClkEsc]  -name ESC_CLK  -period 100  -waveform {0 50}
set_clock_latency 1.5  [get_clocks ESC_CLK]
set_clock_uncertainty -setup 0.2  [get_clocks ESC_CLK]
set_clock_uncertainty -hold 0.1  [get_clocks ESC_CLK]
set_clock_transition -max -rise 0.8 [get_clocks ESC_CLK]
set_clock_transition -min -rise 0.8 [get_clocks ESC_CLK]
set_clock_transition -max -fall 0.8 [get_clocks ESC_CLK]
set_clock_transition -min -fall 0.8 [get_clocks ESC_CLK]
create_clock [get_ports TxSymbolClkHS]  -name SYM_CLK  -period 1  -waveform {0 0.5}
set_clock_latency 0.05  [get_clocks SYM_CLK]
set_clock_uncertainty -setup 0.05  [get_clocks SYM_CLK]
set_clock_uncertainty -hold 0.025  [get_clocks SYM_CLK]
set_clock_transition -max -rise 0.05 [get_clocks SYM_CLK]
set_clock_transition -min -rise 0.05 [get_clocks SYM_CLK]
set_clock_transition -max -fall 0.05 [get_clocks SYM_CLK]
set_clock_transition -min -fall 0.05 [get_clocks SYM_CLK]
create_clock [get_ports TxWordClkHs]  -name WORD_CLK  -period 7  -waveform {0 3.5}
set_clock_latency 0.8  [get_clocks WORD_CLK]
set_clock_uncertainty -setup 0.2  [get_clocks WORD_CLK]
set_clock_uncertainty -hold 0.05  [get_clocks WORD_CLK]
set_clock_transition -max -rise 0.15 [get_clocks WORD_CLK]
set_clock_transition -min -rise 0.15 [get_clocks WORD_CLK]
set_clock_transition -max -fall 0.15 [get_clocks WORD_CLK]
set_clock_transition -min -fall 0.15 [get_clocks WORD_CLK]
create_clock [get_pins clk_recovery_lp/RxClkEsc]  -name RX_ESC_CLK  -period 100  -waveform {0 50}
set_clock_latency 1.5  [get_clocks RX_ESC_CLK]
set_clock_uncertainty -setup 0.2  [get_clocks RX_ESC_CLK]
set_clock_uncertainty -hold 0.1  [get_clocks RX_ESC_CLK]
set_clock_transition -max -rise 0.8 [get_clocks RX_ESC_CLK]
set_clock_transition -min -rise 0.8 [get_clocks RX_ESC_CLK]
set_clock_transition -max -fall 0.8 [get_clocks RX_ESC_CLK]
set_clock_transition -min -fall 0.8 [get_clocks RX_ESC_CLK]
set_input_delay -clock WORD_CLK  1.4  [get_ports {TxDataHS[15]}]
set_input_delay -clock WORD_CLK  1.4  [get_ports {TxDataHS[14]}]
set_input_delay -clock WORD_CLK  1.4  [get_ports {TxDataHS[13]}]
set_input_delay -clock WORD_CLK  1.4  [get_ports {TxDataHS[12]}]
set_input_delay -clock WORD_CLK  1.4  [get_ports {TxDataHS[11]}]
set_input_delay -clock WORD_CLK  1.4  [get_ports {TxDataHS[10]}]
set_input_delay -clock WORD_CLK  1.4  [get_ports {TxDataHS[9]}]
set_input_delay -clock WORD_CLK  1.4  [get_ports {TxDataHS[8]}]
set_input_delay -clock WORD_CLK  1.4  [get_ports {TxDataHS[7]}]
set_input_delay -clock WORD_CLK  1.4  [get_ports {TxDataHS[6]}]
set_input_delay -clock WORD_CLK  1.4  [get_ports {TxDataHS[5]}]
set_input_delay -clock WORD_CLK  1.4  [get_ports {TxDataHS[4]}]
set_input_delay -clock WORD_CLK  1.4  [get_ports {TxDataHS[3]}]
set_input_delay -clock WORD_CLK  1.4  [get_ports {TxDataHS[2]}]
set_input_delay -clock WORD_CLK  1.4  [get_ports {TxDataHS[1]}]
set_input_delay -clock WORD_CLK  1.4  [get_ports {TxDataHS[0]}]
set_input_delay -clock WORD_CLK  1.4  [get_ports TxSendSyncHS]
set_input_delay -clock WORD_CLK  1.4  [get_ports TxReqHS]
set_input_delay -clock WORD_CLK  1.4  [get_ports TxReqEsc]
set_input_delay -clock WORD_CLK  1.4  [get_ports TxLpdtEsc]
set_input_delay -clock WORD_CLK  1.4  [get_ports TxUlpsEsc]
set_input_delay -clock WORD_CLK  1.4  [get_ports TxUlpsExit]
set_input_delay -clock WORD_CLK  1.4  [get_ports {TxTriggerEsc[3]}]
set_input_delay -clock WORD_CLK  1.4  [get_ports {TxTriggerEsc[2]}]
set_input_delay -clock WORD_CLK  1.4  [get_ports {TxTriggerEsc[1]}]
set_input_delay -clock WORD_CLK  1.4  [get_ports {TxTriggerEsc[0]}]
set_input_delay -clock WORD_CLK  1.4  [get_ports {TxDataEsc[7]}]
set_input_delay -clock WORD_CLK  1.4  [get_ports {TxDataEsc[6]}]
set_input_delay -clock WORD_CLK  1.4  [get_ports {TxDataEsc[5]}]
set_input_delay -clock WORD_CLK  1.4  [get_ports {TxDataEsc[4]}]
set_input_delay -clock WORD_CLK  1.4  [get_ports {TxDataEsc[3]}]
set_input_delay -clock WORD_CLK  1.4  [get_ports {TxDataEsc[2]}]
set_input_delay -clock WORD_CLK  1.4  [get_ports {TxDataEsc[1]}]
set_input_delay -clock WORD_CLK  1.4  [get_ports {TxDataEsc[0]}]
set_input_delay -clock WORD_CLK  1.4  [get_ports TxValidEsc]
set_input_delay -clock WORD_CLK  1.4  [get_ports TurnRequest]
set_input_delay -clock WORD_CLK  1.4  [get_ports TurnDisable]
set_input_delay -clock WORD_CLK  1.4  [get_ports ForceRxmode]
set_input_delay -clock WORD_CLK  1.4  [get_ports ForceTxStopmode]
set_input_delay -clock WORD_CLK  1.4  [get_ports Enable]
set_input_delay -clock ESC_CLK  20  [get_ports LP_CD_A]
set_input_delay -clock ESC_CLK  20  [get_ports LP_CD_B]
set_input_delay -clock ESC_CLK  20  [get_ports LP_CD_C]
set_input_delay -clock RX_ESC_CLK  20  [get_ports {LpRx[2]}]
set_input_delay -clock RX_ESC_CLK  20  [get_ports {LpRx[1]}]
set_input_delay -clock RX_ESC_CLK  20  [get_ports {LpRx[0]}]
set_output_delay -clock WORD_CLK  1.4  [get_ports TxReadyHS]
set_output_delay -clock WORD_CLK  1.4  [get_ports LpTxEn]
set_output_delay -clock WORD_CLK  1.4  [get_ports HsTxEn]
set_output_delay -clock WORD_CLK  1.4  [get_ports TxReadyEsc]
set_output_delay -clock WORD_CLK  1.4  [get_ports Direction]
set_output_delay -clock WORD_CLK  1.4  [get_ports Stopstate]
set_output_delay -clock WORD_CLK  1.4  [get_ports ErrContentionLP0]
set_output_delay -clock WORD_CLK  1.4  [get_ports ErrContentionLP1]
set_output_delay -clock WORD_CLK  1.4  [get_ports UlpsActiveNot]
set_output_delay -clock WORD_CLK  1.4  [get_ports ErrEsc]
set_output_delay -clock WORD_CLK  1.4  [get_ports ErrSyncEsc]
set_output_delay -clock WORD_CLK  1.4  [get_ports ErrControl]
set_output_delay -clock WORD_CLK  1.4  [get_ports LpRxEn]
set_output_delay -clock ESC_CLK  20  [get_ports {LpTx[2]}]
set_output_delay -clock ESC_CLK  20  [get_ports {LpTx[1]}]
set_output_delay -clock ESC_CLK  20  [get_ports {LpTx[0]}]
set_output_delay -clock RX_ESC_CLK  20  [get_ports {RxEscData[7]}]
set_output_delay -clock RX_ESC_CLK  20  [get_ports {RxEscData[6]}]
set_output_delay -clock RX_ESC_CLK  20  [get_ports {RxEscData[5]}]
set_output_delay -clock RX_ESC_CLK  20  [get_ports {RxEscData[4]}]
set_output_delay -clock RX_ESC_CLK  20  [get_ports {RxEscData[3]}]
set_output_delay -clock RX_ESC_CLK  20  [get_ports {RxEscData[2]}]
set_output_delay -clock RX_ESC_CLK  20  [get_ports {RxEscData[1]}]
set_output_delay -clock RX_ESC_CLK  20  [get_ports {RxEscData[0]}]
set_output_delay -clock RX_ESC_CLK  20  [get_ports RxValidEsc]
set_output_delay -clock RX_ESC_CLK  20  [get_ports {RxTriggerEsc[3]}]
set_output_delay -clock RX_ESC_CLK  20  [get_ports {RxTriggerEsc[2]}]
set_output_delay -clock RX_ESC_CLK  20  [get_ports {RxTriggerEsc[1]}]
set_output_delay -clock RX_ESC_CLK  20  [get_ports {RxTriggerEsc[0]}]
set_output_delay -clock RX_ESC_CLK  20  [get_ports RxUlpsEsc]
set_output_delay -clock RX_ESC_CLK  20  [get_ports RxLpdtEsc]
set_clock_groups -asynchronous -name RX_ESC_CLK_1 -group [get_clocks RX_ESC_CLK] -group [get_clocks WORD_CLK]
set_clock_groups -asynchronous -name ESC_CLK_1 -group [get_clocks ESC_CLK] -group [get_clocks WORD_CLK]
set_clock_groups -asynchronous -name ESC_CLK_2 -group [get_clocks ESC_CLK] -group [get_clocks SYM_CLK]
set_clock_groups -asynchronous -name WORD_CLK_1 -group [get_clocks WORD_CLK] -group [get_clocks SYM_CLK]
set_clock_groups -asynchronous -name WORD_CLK_2 -group [get_clocks WORD_CLK] -group [get_clocks ESC_CLK]
set_clock_groups -asynchronous -name WORD_CLK_3 -group [get_clocks WORD_CLK] -group [get_clocks RX_ESC_CLK]
